
**** sample
#+name: pd2org
#+begin_src python :var df="df" :exports none
  return f"return tabulate({df}, headers={df}.columns, tablefmt='orgtbl')"
#+end_src

#+header: :prologue from tabulate import tabulate
#+header: :noweb strip-export
#+begin_src python :results value raw :exports both
  import pandas as pd
  df = pd.DataFrame({
      "a": [1,2,3],
      "b": [4,5,6]
  })
  <<pd2org("df")>>
#+end_src

#+RESULTS:
|   | a | b |
|---+---+---|
| 0 | 1 | 4 |
| 1 | 2 | 5 |
| 2 | 3 | 6 |







*** 单元二实验
#+begin_src python :results output
def narcissu():
    for i in range(100,1000):
        s = (i%10) **3 + (int(i/10)%10)**3 + int(i/100) ** 3
        if s == i:
            print(s)

def tranagle():
    start = 7
    for i in range(start,0,-2):
        for z in range( int((start-i)/2) ):
            print(" ",end="")
        for j in range(i):
            print("*",end="")
        for z in range(start-i):
            print(" ",end="")
        print("")

def productList():
    for i in range(1,10):
        for j in range(1,i+1):
            print("{}*{}={}".format(i,j,i*j),end=" ")
        print("")

narcissu()
tranagle()
productList()
#+end_src

#+RESULTS:
#+begin_example
153
370
371
407
,*******
 ,*****
  ,***
   ,*
1*1=1
2*1=2 2*2=4
3*1=3 3*2=6 3*3=9
4*1=4 4*2=8 4*3=12 4*4=16
5*1=5 5*2=10 5*3=15 5*4=20 5*5=25
6*1=6 6*2=12 6*3=18 6*4=24 6*5=30 6*6=36
7*1=7 7*2=14 7*3=21 7*4=28 7*5=35 7*6=42 7*7=49
8*1=8 8*2=16 8*3=24 8*4=32 8*5=40 8*6=48 8*7=56 8*8=64
9*1=9 9*2=18 9*3=27 9*4=36 9*5=45 9*6=54 9*7=63 9*8=72 9*9=81
#+end_example

**** 普通的发红包

普通的list和random库
#+begin_src python :results output
  import random

  fuck:list = [ "岢岚","加vi","虞城","写特","倒戈","迎客" ]
  shit:dict = {}
  def theLuckist():
      num:int = 0;
      theBig = 0
      outer = 0
      for i in fuck:
          theMoney = random.randint(1,10)
          shit[i] = theMoney;
          if theMoney > theBig:
              theBig = theMoney
              outer = num
          num = num + 1
      return outer

  print("%s Get my Bigest "%fuck[theLuckist()])
  print(shit)
#+end_src

#+RESULTS:
: 写特 Get my Bigest
: {'岢岚': 2, '加vi': 6, '虞城': 4, '写特': 10, '倒戈': 1, '迎客': 6}

**** fib
python的递归好丑,
还会遇到不能直接返回的问题
#+begin_src python :results output
  def __fib(num:int,state:int)->int:
      if num != 0:
          return (__fib(num-1,state+num))
      else:
          return state # This belongs to last funcall

  def fib(inpt:int)->int:
      return __fib(inpt,1)

  print(fib(199))
#+end_src

#+RESULTS:
: 19901
*** 单元四实验
#+begin_src python :stdin 4 :output results
  myDict:dict = dict()
  def readDict():
      print("Initalizing...\n")
      with open("./dict.txt") as theDict:
          fuck = list(str.split(theDict.read()))
          for i in range(0,len(fuck)-1,2):
              myDict[fuck[i]] = fuck[i+1]
          print(myDict)

  def addAction():
      inf = input("Sample input :\nboy 男孩\n").split()
      myDict[inf[0]] = inf[1]

  def writetoDict():
      print("Writing to dict")
      with open("./dict.txt",mode="w+") as theDict:
          for i,j in myDict.items():
              theDict.write(str.format("{} {} ".format(i,j)))

  def mainLoop():
      try:
          choice:int = int(input("Welcome! \n0 to print dict 1 to add, 2 to search, 3 to write to dict 4 to quit\n"))
      except:
          print("Error input! Restarting...")
          mainLoop()

      if choice == 1:
          addAction()
      elif choice == 0:
          for i,j in myDict.items():
              print(i,j)
      elif choice == 2:
          theKey = input("Enter you key(English)\n")
          print("That is {}".format(myDict[theKey]))
      elif choice == 3:
          writetoDict()
      elif choice ==4:
          print("bye!")
          exit()
      else:
          print("Error input! Restarting...")
      mainLoop()

  if __name__ == '__main__':
      readDict()
      mainLoop()
#+end_src

#+RESULTS:
    : Welcome!
    : 0 to print dict 1 to add, 2 to search, 3 to write to dict 4 to quit
    : boy 男孩
    : next 下一个
    : door 门
    : bye!




*** Basic of numpy
你可以用 array得到一个矩阵,

#+begin_src python :results output
  import numpy as np
  import numpy_indexed as npi # provide functions like intersection, powerful extension!
  M = np.array([[0,0,1,0,0],[0,0,0,1,0],[1,0,0,0,1],[0,0,1,0,0],[1,1,0,1,0]])
  N = M
  print(M)
  # for i in range(5):
  #     print(N.dot(M))
  #     N = N.dot(M)

  # You can use boolean variables to emulate 0-1 matrix
  shit:np.array = np.array([[False,False,True,False,False],[False,False,False,True,False],[True,False,False,False,False],[False,True,False,False,False],[False,False,False,True,False]])
  fuck = shit
  out = shit

  print(shit)

  print(npi.intersection(shit,fuck))
#+end_src

#+RESULTS:
#+begin_example
[[0 0 1 0 0]
 [0 0 0 1 0]
 [1 0 0 0 1]
 [0 0 1 0 0]
 [1 1 0 1 0]]
[[False False  True False False]
 [False False False  True False]
 [ True False False False False]
 [False  True False False False]
 [False False False  True False]]
[[False False False  True False]
 [False False  True False False]
 [False  True False False False]
 [ True False False False False]]
#+end_example

